src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ЦенообразованиеВызовСервера/Module.bsl
Функция ПолучитьЦенуНоменклатуры(Номенклатура, Период) Экспорт
	ТаблицаСтроки = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(Период, Новый Структура("Номенклатура", Номенклатура));
	Если ТаблицаСтроки.Количество() > 0 Тогда
		Возврат ТаблицаСтроки[0].Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
